Revit 2026 API

# UVDivision Operator

---

Divides the specified 2-D vector by the specified value.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static UV operator /(
	UV left,
	double value
)
```
```vb
Public Shared Operator / (
	left As UV,
	value As Double
) As UV
```
```cpp
public:
static UV^ operator /(
	UV^ left,
	double value
)
```
```fsharp
static let inline (/)
        left : UV *
        value : float  : UV
```

#### Parameters

left UV
    The value to divide the vector by.
value Double
    The vector to divide by the value.

#### Return Value

UVThe divided 2-D vector.

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when the specified value is an infinite number or zero. |
| ArgumentNullException | Thrown when left is . |

The divided vector is obtained by dividing each coordinate of the specified vector by the specified value.

#### Reference

UV Class

Autodesk.Revit.DB Namespace